import math
# #已知数据
movie_data = {"宝贝当家": [45, 2, 9, "喜剧片"],
              "美人鱼": [21, 17, 5, "喜剧片"],
              "澳门风云3": [54, 9, 11, "喜剧片"],
              "功夫熊猫3": [39, 0, 31, "喜剧片"],
              "谍影重重": [5, 2, 57, "动作片"],
              "叶问3": [3, 2, 65, "动作片"],
              "伦敦陷落": [2, 3, 55, "动作片"],
              "我的特工爷爷": [6, 4, 21, "动作片"],
              "奔爱": [7, 46, 4, "爱情片"],
              "夜孔雀": [9, 39, 8, "爱情片"],
              "代理情人": [9, 38, 2, "爱情片"],
              "新步步惊心": [8, 34, 17, "爱情片"]}
#
#
#
#
# 初始样本唐人街探案": [23, 3, 17, "？"]
x = [23, 3, 17]
KNN = []
for key, v in movie_data.items():
    #计算欧式距离
    d = math.sqrt((x[0] - v[0]) ** 2 + (x[1] - v[1]) ** 2 + (x[2] - v[2]) ** 2)
    KNN.append([key, round(d, 2)])
#按照距离大小进行递增排序
KNN.sort(key=lambda dis: dis[1])
#K= 5，即选择距离 唐人街探案 最近的5个值。
#[['我的特工爷爷', 17.49], ['美人鱼', 18.55], ['功夫熊猫3', 21.47], ['宝贝当家', 23.43], ['澳门风云3', 32.14]]
KNN=KNN[:5]
#确定前k个样本所在类别出现的频率，并输出出现频率最高的类别
labels = {"喜剧片":0,"动作片":0,"爱情片":0}
for s in KNN:
    #根据电影名，计算出现的次数
    label = movie_data[s[0]]
    labels[label[3]] += 1
#根据影片的名称出现的次数进行排序,排序后生成了一个列表。
labels = sorted(labels.items(),key=lambda l: l[1],reverse=True)
print("分类统计的结果{},预估的结果= {}".format(labels,labels[0][0]))